<a href="#"><img  height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /></a> 

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 5</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```

aws_security_group.Scenario5: Refreshing state... [id=sg-0a76ddfb4eba2f7c4]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.


```
<br>

</details> <!-- End Format Logs -->


</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 6</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario6 will be created
  + resource "aws_security_group" "Scenario6" {
      + arn                    = (known after apply)
      + description            = "Ingress"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 30
            },
          + {
              + cidr_blocks      = [
                  + "192.168.1.1/32",
                  + "192.168.1.2/32",
                  + "192.168.1.3/32",
                  + "192.168.0.0/16",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "udp"
              + security_groups  = []
              + self             = false
              + to_port          = 30
            },
        ]
      + name                   = "SG with port range(UDP and TCP) and all Multiple IP"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Scenario6"
        }
      + tags_all               = {
          + "Name" = "Scenario6"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 6\tmp\Scenario 6.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 6\\tmp\\Scenario 6.out"


```
<br>

</details> <!-- End Format Logs -->


</details>

---

<details>
<summary><sub><sub><sub><a href="#"><img  height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></a></sub></sub></sub>&nbsp;&nbsp;<h3><b>Scenario 8</b></h3></summary>

<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.Scenario8 will be created
  + resource "aws_security_group" "Scenario8" {
      + arn                    = (known after apply)
      + description            = "Ingress"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-5728062a",
                ]
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "SG with Rule with SG in source"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Scenario8"
        }
      + tags_all               = {
          + "Name" = "Scenario8"
        }
      + vpc_id                 = "vpc-481b202f"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 8\tmp\Scenario 8.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/DevSecpsRepoForAutomation/DevSecpsRepoForAutomation_ALGOSEC_CODE_ANALYSIS/Scenario 8\\tmp\\Scenario 8.out"


```
<br>

</details> <!-- End Format Logs -->


</details>

---


<br>
Pusher: @similAlgo<br>
Action: pull_request<br>
Workflow: Test Repo CI/CD